In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
tips = sns.load_dataset('tips')
tips.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [4]:
tips.sample(5)

     total_bill   tip     sex smoker   day    time  size
152       17.26  2.74    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
218        7.74  1.44    Male    Yes   Sat  Dinner     2
164       17.51  3.00  Female    Yes   Sun  Dinner     2
89        21.16  3.00    Male     No  Thur   Lunch     2

In [5]:
is_weekend = tips.day.isin(['Sat', 'Sun']).sample(5)
is_weekend

127    False
149    False
2       True
241     True
32      True
Name: day, dtype: bool

In [7]:
tips[tips.day.isin(['Sat','Sun'])].sample(5)

     total_bill   tip     sex smoker  day    time  size
1         10.34  1.66    Male     No  Sun  Dinner     3
66        16.45  2.47  Female     No  Sat  Dinner     2
177       14.48  2.00    Male    Yes  Sun  Dinner     2
27        12.69  2.00    Male     No  Sat  Dinner     2
183       23.17  6.50    Male    Yes  Sun  Dinner     4

In [8]:
tips[['time','day']].drop_duplicates(keep='first')

       time   day
0    Dinner   Sun
19   Dinner   Sat
77    Lunch  Thur
90   Dinner   Fri
220   Lunch   Fri
243  Dinner  Thur

In [10]:
pd.cut(tips['total_bill'], 3, labels=['low', 'mid', 'high']).head()

0    low
1    low
2    mid
3    mid
4    mid
Name: total_bill, dtype: category
Categories (3, object): ['low' < 'mid' < 'high']

In [11]:
tips.sex.str.lower().head()

0    female
1      male
2      male
3      male
4    female
Name: sex, dtype: object

In [13]:
tips.isna().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [14]:
tips.tip.fillna(0, inplace=True)

In [15]:
tips.dropna(axis=1, how='any', inplace=True)

In [16]:
tips[['tip', 'total_bill']].corr('pearson')

                 tip  total_bill
tip         1.000000    0.675734
total_bill  0.675734    1.000000

In [17]:
tips.tip.rank().head()

0      5.0
1     33.0
2    177.0
3    165.0
4    185.0
Name: tip, dtype: float64

In [18]:
tips.rename(columns={'total_bill': 'bill'}, inplace=True)

In [19]:
for tup in tips.itertuples():
    print(tup)
    break

Pandas(Index=0, bill=16.99, tip=1.01, sex='Female', smoker='No', day='Sun', time='Dinner', size=2)